{
  "irVersion": "1.0",
  "project": "lintfix",
  "repository": "https://github.com/grokify/lintfix",
  "versioning": "semver",
  "commitConvention": "conventional",
  "maintainers": ["grokify"],
  "releases": [
    {
      "version": "v0.1.0",
      "date": "2026-03-07",
      "highlights": [
        { "description": "Structured lint remediation database mapping golangci-lint rules to fix strategies" },
        { "description": "Nolint comment generators with pre-written reason strings for common scenarios" }
      ],
      "added": [
        { "description": "Remediation database with support for gosec, staticcheck, and errcheck rules", "commit": "45810d6" },
        { "description": "`LoadRemediations()` and `MustLoadRemediations()` functions to load embedded database", "commit": "45810d6" },
        { "description": "`RemediationDB.Get()`, `GetGosec()`, `GetStaticcheck()` methods for querying rules", "commit": "45810d6" },
        { "description": "`RuleFix.HasHelper()` method to check if a code-based helper function exists", "commit": "45810d6" },
        { "description": "`gosec.Nolint()` generic function for generating nolint:gosec comments", "commit": "45810d6" },
        { "description": "`gosec.NolintG117()`, `NolintG118()`, `NolintG704()`, `NolintG101()` rule-specific generators", "commit": "45810d6" },
        { "description": "`gosec.CommonReasons` struct with pre-written reason strings for OAuth, shutdown handlers, SSRF, etc.", "commit": "45810d6" },
        { "description": "JSON schema for remediation database with type, summary, pattern, package, function, example fields", "commit": "45810d6" }
      ],
      "documentation": [
        { "description": "Package documentation with usage examples for database queries and nolint generation", "commit": "45810d6" },
        { "description": "README with installation, usage examples, and supported linters reference", "commit": "45810d6" }
      ]
    }
  ]
}
